lvx/base/Documents/бит_ПереоценкаВалютныхДенежныхСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ПереоценкаВалютныхДенежныхСтатей</Name>
			<Comment>(БИТ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Comment>Регистр бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов1</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов2</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов3</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов4</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов1</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов2</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов3</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов4</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаСуммаУпр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаСуммаСценарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаСуммаМУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаСуммаРегл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемЦФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_ПереоценкаВалютныхДенежныхСтатей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция готовит таблицы документа для проведения.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура - структура шапки документа.
//  СтруктураКурсыВалют 	- Структура - структура курсов валют.
// 
// Возвращаемое значение:
//  Структура - структура таблиц документа.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, СтруктураКурсыВалют)  Экспорт
	
	ИмяРегБухгалтерии = СтруктураШапкиДокумента.ИмяРегистраБухгалтерии;
	ИмяПланаСчетов 	  = Метаданные.РегистрыБухгалтерии[ИмяРегБухгалтерии].ПланСчетов.Имя;
	
	// Получим массив валютных счетов для переоценки.
	МассивСчетов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка
	|ИЗ
	|	&ИмяПланаСчетов КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.Валютный";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПланаСчетов", СтрШаблон("ПланСчетов.%1", ИмяПланаСчетов));
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();		
		Пока ВыборкаИзЗапроса.Следующий() Цикл
			МассивСчетов.Добавить(ВыборкаИзЗапроса.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаПереоценки"	 	  , СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("ИмяРегБухгалтерии" 	  , ИмяРегБухгалтерии);
	СтруктураПараметров.Вставить("МассивСчетов"		 	  , МассивСчетов);
	СтруктураПараметров.Вставить("ПереоценкаСуммаУпр"	  , СтруктураШапкиДокумента.ПереоценкаСуммаУпр);
	СтруктураПараметров.Вставить("ПереоценкаСуммаРегл"	  , СтруктураШапкиДокумента.ПереоценкаСуммаРегл);
	СтруктураПараметров.Вставить("ПереоценкаСуммаСценарий", СтруктураШапкиДокумента.ПереоценкаСуммаСценарий);
	Если бит_ОбщегоНазначения.ЕстьОбъектыМСФО() И бит_ОбщегоНазначения.ЕстьРеквизит("ПереоценкаСуммаМУ", Метаданные.Документы.бит_ПереоценкаВалютныхДенежныхСтатей) Тогда
		СтруктураПараметров.Вставить("ПереоценкаСуммаМУ", СтруктураШапкиДокумента.ПереоценкаСуммаМУ);
	КонецЕсли;
	СтруктураПараметров.Вставить("СтруктураКурсыВалют"	  , СтруктураКурсыВалют);
	СтруктураПараметров.Вставить("ЦФО"	                  , СтруктураШапкиДокумента.ЦФО);
	СтруктураПараметров.Вставить("ПоВсемОрганизациям"     , СтруктураШапкиДокумента.ПоВсемОрганизациям);
	СтруктураПараметров.Вставить("ПоВсемЦФО"              , СтруктураШапкиДокумента.ПоВсемЦФО);
	
	// Если это регистр бюджетирования, тогда
	Если ИмяРегБухгалтерии = "бит_Бюджетирование" Тогда
		СтруктураПараметров.Вставить("Сценарий", СтруктураШапкиДокумента.Сценарий);
	    ЕстьОрганизация = бит_МеханизмДопИзмерений.ЕстьДопИзмерениеОрганизация();			
		Если ЕстьОрганизация Тогда
			
			СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
			
		КонецЕсли; 
	Иначе
		СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	КонецЕсли;
	
	// Получим таблицу по переоценки валютных денежных статей.
	ТаблицаПоПереоценке = бит_УправленческийУчет.ДанныеПереоценкиВалютныхДенежныхСтатей(СтруктураПараметров);
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТаблицаПереоценки", ТаблицаПоПереоценке);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПервоначальноеЗаполнениеДокумента(ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	ПервоначальноеЗаполнениеДокумента(, ОбъектКопирования);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект, Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента();
	
	// Получим курсы валют, неоходимые для выполнения пересчетов.
	ВидыКурсов = Новый Структура("Упр,МУ,Регл");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	// Если это регистр бюджетирования, тогда
	Если СтруктураШапкиДокумента.ИмяРегистраБухгалтерии = "бит_Бюджетирование" Тогда
		
		// Получим курс кратность валюты сценария.
		ВалютаСценария	   	   = СтруктураШапкиДокумента.Сценарий.Валюта;
		СтруктураКурсыСценария = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаСценария, СтруктураШапкиДокумента.Дата);
		СтруктураКурсыСценария.Вставить("Валюта", ВалютаСценария);
		
		СтруктураКурсыВалют.Вставить("Сценарий", СтруктураКурсыСценария);
		СтруктураШапкиДокумента.Вставить("ЕстьАналитикаОрганизация", бит_МеханизмДопИзмерений.ЕстьДопИзмерениеОрганизация());		
		
	КонецЕсли;
	
	// Получим структура таблиц.
	СтруктураТаблиц = ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, СтруктураКурсыВалют);	
	
	ПроверкаДанных(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение созданного/скопированного документа.
// 
// Параметры:
//  ДанныеЗаполнения		  - Структура. По умолчанию Неопределено.
//  ПараметрОбъектКопирования - ДокументОбъект. По умолчанию Неопределено.
// 
Процедура ПервоначальноеЗаполнениеДокумента(ДанныеЗаполнения = Неопределено, ПараметрОбъектКопирования = Неопределено)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ПараметрОбъектКопирования);
	
	Если ПараметрОбъектКопирования = Неопределено Тогда
		
		// Заполнение объекта системы.
		Если НЕ ЗначениеЗаполнено(ОбъектСистемы) Тогда
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
				И ДанныеЗаполнения.Свойство("ОбъектСистемы") Тогда
				ОбъектСистемы = ДанныеЗаполнения.ОбъектСистемы;
			Иначе
				// Для новой записи заполним объект системы из настроек пользователя.
				ПолучаемаяНастройка = ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойРегистрБухгалтерииУУ;
				ОбъектСистемы 		= бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ПолучаемаяНастройка);
			КонецЕсли;
			
		КонецЕсли; 
				
		ПереоценкаСуммаУпр = Истина;
		
		Если ЗначениеЗаполнено(ОбъектСистемы) И ОбъектСистемы.ИмяОбъекта = "бит_Дополнительный_2" Тогда			
			ПереоценкаСуммаМУ = Истина;			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Функция получает структуру шапки документа.
// 
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  СтруктураШапкиДокумента - Структура.
// 
Функция СформироватьСтруктуруШапкиДокумента()
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Дополним структуру.
	ИмяРегистраБухгалтерии = СтруктураШапкиДокумента.ОбъектСистемы.ИмяОбъекта;
	КоличествоСубконто 	   = Метаданные.РегистрыБухгалтерии[ИмяРегистраБухгалтерии].ПланСчетов.МаксКоличествоСубконто;
	
	СтруктураШапкиДокумента.Вставить("ИмяРегистраБухгалтерии", ИмяРегистраБухгалтерии);
	СтруктураШапкиДокумента.Вставить("КоличествоСубконто"	 , КоличествоСубконто);
	
	Возврат СтруктураШапкиДокумента;
	
КонецФункции // СформироватьСтруктуруШапкиДокумента()

// Процедура выполняет проверку данных документа.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
// 
Процедура ПроверкаДанных(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок)
	
	// Сформируем структуру обязательных полей.
	СтруктураОбязательныхПолей = Новый Структура;
	
	// Если это регистр бюджетирования, тогда
	Если СтруктураШапкиДокумента.ИмяРегистраБухгалтерии = "бит_Бюджетирование" Тогда
		СтруктураОбязательныхПолей.Вставить("Сценарий");
	Иначе
		СтруктураОбязательныхПолей.Вставить("Организация");
	КонецЕсли;
	
	// Проверим заполнение шапки.
	бит_РаботаСМетаданными.ПроверитьЗаполнениеШапки(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверкаДанных()

// Процедура выполняет движения по регистрам.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  СтруктураКурсыВалют 	- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Отказ, Заголовок)
	
	РесурсыПереоценки = Новый Массив;
	
	Если СтруктураШапкиДокумента.ПереоценкаСуммаУпр Тогда
		РесурсыПереоценки.Добавить("СуммаУпр");
	КонецЕсли;
	Если СтруктураШапкиДокумента.ПереоценкаСуммаРегл Тогда
		РесурсыПереоценки.Добавить("СуммаРегл");
	КонецЕсли;
	Если СтруктураШапкиДокумента.ПереоценкаСуммаСценарий Тогда
		РесурсыПереоценки.Добавить("СуммаСценарий");
	КонецЕсли;
	Если бит_ОбщегоНазначения.ЕстьОбъектыМСФО() 
		И СтруктураШапкиДокумента.Свойство("ПереоценкаСуммаМУ") И СтруктураШапкиДокумента.ПереоценкаСуммаМУ Тогда
		РесурсыПереоценки.Добавить("СуммаМУ");
	КонецЕсли;
	
	// Валюты сравнения
	ВалютаСравненияУпр  = СтруктураКурсыВалют.Упр.Валюта;
	ВалютаСравненияМу   = СтруктураКурсыВалют.Му.Валюта;
	ВалютаСравненияРегл = СтруктураКурсыВалют.Регл.Валюта;

	ТаблицаДанных = СтруктураТаблиц.ТаблицаПереоценки;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		Для Каждого ТекИмяРесурса Из РесурсыПереоценки Цикл
			
			ЗначениеРесурса = СтрокаТаблицы[ТекИмяРесурса];
			
			Если ТекИмяРесурса = "СуммаУпр" И (ВалютаСравненияУпр = СтрокаТаблицы.Валюта) Тогда
				// Не формировать переоценку по упр учету, если валюта договора или расчетного счета равна валюте упр. учета.
				Продолжить;	
			ИначеЕсли ТекИмяРесурса = "СуммаМУ" И (ВалютаСравненияМу = СтрокаТаблицы.Валюта) Тогда
				// Не формировать переоценку по МСФО, если валюта договора или расчетного счета равна валюте МСФО.
				Продолжить;		
			ИначеЕсли ТекИмяРесурса = "СуммаРегл" И (ВалютаСравненияРегл = СтрокаТаблицы.Валюта) Тогда
				// Не формировать переоценку по регл.учету, если валюта договора или расчетного счета равна валюте МСФО.
				Продолжить;	
			КонецЕсли;
			
			// Если значение ресурса больше нуля, тогда
			Если ЗначениеРесурса > 0 Тогда
				
				// Отобразим курсовую разницу по доходу.
				// ДТ СчетУчета КТ СчетДоходов Сумма.
				СформироватьЗаписьПоДоходу(СтруктураШапкиДокумента, СтрокаТаблицы, ТекИмяРесурса);
				
				// Иначе если значение ресурса меньше нуля, тогда.
			ИначеЕсли ЗначениеРесурса < 0 Тогда
				
				// Отобразим курсовую разницу по расходу.
				// ДТ СчетРасходов КТ СчетУчета Сумма.
				СформироватьЗаписьПоРасходу(СтруктураШапкиДокумента, СтрокаТаблицы, ТекИмяРесурса);
				
			КонецЕсли;
			
		КонецЦикла; // Для Каждого КлючЗначение Из РесурсыПереоценки Цикл.
		
	КонецЦикла; // Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл.
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Процедура формирует движение курсовой разницы по доходу.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтрокаТаблицы 			- СтрокаТаблицыЗначений.
//  ИмяРесурса 				- Строка.
// 
Процедура СформироватьЗаписьПоДоходу(СтруктураШапкиДокумента, СтрокаТаблицы, ИмяРесурса)
	
	Запись = Движения[СтруктураШапкиДокумента.ИмяРегистраБухгалтерии].Добавить();
	
	// Заполнение атрибутов записи.
	ЗаполнитьАтрибутыЗаписи(Запись, СтруктураШапкиДокумента, СтрокаТаблицы);
	
	// Заполним аналитику счета Дт и Кт.
	ЗаполнитьАналитикуЗаписи(Запись, СтруктураШапкиДокумента, СтрокаТаблицы);
												   
	// Заполним сумму.
	Запись[ИмяРесурса] = СтрокаТаблицы[ИмяРесурса];
	
КонецПроцедуры // СформироватьЗаписьПоДоходу()

// Процедура формирует движение курсовой разницы по расходу.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтрокаТаблицы 			- СтрокаТаблицыЗначений.
//  ИмяРесурса 				- Строка.
// 
Процедура СформироватьЗаписьПоРасходу(СтруктураШапкиДокумента, СтрокаТаблицы, ИмяРесурса)
	
	Запись = Движения[СтруктураШапкиДокумента.ИмяРегистраБухгалтерии].Добавить();
	
	// Заполнение атрибутов записи.
	ЗаполнитьАтрибутыЗаписи(Запись, СтруктураШапкиДокумента, СтрокаТаблицы, Ложь);
	
	// Заполним аналитику счета Дт и Кт.
	ЗаполнитьАналитикуЗаписи(Запись, СтруктураШапкиДокумента, СтрокаТаблицы, Ложь);
	
	// Заполним сумму.
	Запись[ИмяРесурса] = СтрокаТаблицы[ИмяРесурса] * -1;
		
КонецПроцедуры // СформироватьЗаписьПоРасходу()

// Процедура заполняет атрибуты записи.
// 
// Параметры:
//  Запись					- РегистрБухгалтерииЗапись.
//  СтруктураШапкиДокумента - Структура.
//  СтрокаТаблицы 			- СтрокаТаблицыЗначений.
//  ЭтоДоход                - Булево. По умолчанию Истина.
// 
Процедура ЗаполнитьАтрибутыЗаписи(Запись, СтруктураШапкиДокумента, СтрокаТаблицы, ЭтоДоход = Истина)
	
	Если СтруктураШапкиДокумента.ИмяРегистраБухгалтерии = "бит_Бюджетирование" Тогда
		Запись.Сценарий    = СтруктураШапкиДокумента.Сценарий;
		Запись.ЦФО		   = СтрокаТаблицы.ЦФО;
		Если СтруктураШапкиДокумента.Свойство("ЕстьАналитикаОрганизация") И СтруктураШапкиДокумента.ЕстьАналитикаОрганизация = Истина Тогда
			
			Запись.Организация = СтрокаТаблицы.Организация;		
			
		КонецЕсли; 
	Иначе	
		Запись.Организация = СтрокаТаблицы.Организация;
	КонецЕсли;

	Запись.Период     = СтруктураШапкиДокумента.Дата;
	Запись.Активность = Истина;
	
	ТекстСодержания   = НСтр("ru = 'Курсовая разница'; en = 'Exchange difference'");
	Запись.Содержание = ТекстСодержания;
	
	Если ЭтоДоход Тогда
		Запись.СчетДт = СтрокаТаблицы.Счет;
		Запись.СчетКт = СтруктураШапкиДокумента.СчетДоходов;
	Иначе
		Запись.СчетДт = СтруктураШапкиДокумента.СчетРасходов;
		Запись.СчетКт = СтрокаТаблицы.Счет;
	КонецЕсли;
    
    СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Запись.СчетДт);
    СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Запись.СчетКт);
    
	Если СвСчДт.Валютный Тогда
		Запись.ВалютаДт        = СтрокаТаблицы.Валюта;
		Запись.ВалютнаяСуммаДт = 0;
	КонецЕсли; 
	
	Если СвСчКт.Валютный Тогда
		Запись.ВалютаКт        = СтрокаТаблицы.Валюта;
		Запись.ВалютнаяСуммаКт = 0;
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьАтрибутыЗаписи()

// Процедура заполняет аналитику счета Дт и Кт записи.
// 
// Параметры:
//  Запись					- РегистрБухгалтерииЗапись.
//  СтруктураШапкиДокумента - Структура.
//  СтрокаТаблицы 			- СтрокаТаблицыЗначений.
//  ЭтоДоход                - Булево. По умолчанию Истина.
// 
Процедура ЗаполнитьАналитикуЗаписи(Запись, СтруктураШапкиДокумента, СтрокаТаблицы, ЭтоДоход = Истина)
	
	КоличествоСубконто = СтруктураШапкиДокумента.КоличествоСубконто;
	
	Для Ном = 1 По КоличествоСубконто Цикл
		
		Если ЭтоДоход Тогда
			ЗначениеАналитикиДт = СтрокаТаблицы["Субконто" + Ном];
			ЗначениеАналитикиКт = СтруктураШапкиДокумента["СубконтоДоходов" + Ном];
		Иначе
			ЗначениеАналитикиДт = СтруктураШапкиДокумента["СубконтоРасходов" + Ном];
			ЗначениеАналитикиКт = СтрокаТаблицы["Субконто" + Ном];
		КонецЕсли;
		
		бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, Ном, ЗначениеАналитикиДт);
		бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, Ном, ЗначениеАналитикиКт);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьАналитикуЗаписи()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
